## 运算符
'''
| `[]` `[:]`                                                   | 下标，切片                    
| ------------------------------------------------------------ | ------------------------------ 
| `**`                                                         | 指数                           
| `~` `+` `-`                                                  | 按位取反, 正负号               
| `*` `/` `%` `//`                                             | 乘，除，模，整除               
| `+` `-`                                                      | 加，减                         
| `>>` `<<`                                                    | 右移，左移                    
| `&`                                                          | 按位与                        
| `^` `\|`                                                     | 按位异或，按位或               
| `<=` `<` `>` `>=`                                            | 小于等于，小于，大于，大于等于  
| `==` `!=`                                                    | 等于，不等于                   
| `is`  `is not`                                               | 身份运算符                     
| `in` `not in`                                                | 成员运算符                     
| `not` `or` `and`                                             | 逻辑运算符                     
| `=` `+=` `-=` `*=` `/=` `%=` `//=` `**=` `&=` `|=` `^=` `>>=` `<<=` | （复合）赋值运算符             
'''

## 尝试几个以前没用过的
print(2**10)
print(1>>2)
print(~0b10101)

## 下面可以进行一些简单的运算例子了
## eg:输入圆的半径计算计算周长和面积
print("test")
rad=float(input("输入圆半径："))
perimerter=2*3.14159*rad
area=3.14159*rad**2
print("周长：%.2f"%perimerter)
print("面积：%.2f"%area)

## note：变量=类型(input("文字"))，可以让用户输入的同时，显示出文字，并且限定类型

## eg:判断是不是闰年
years=int(input("请输入年份："))
if(years%100==0):
    if(years%400==0):
        print("是闰年")
    
    else:
        print("不是闰年")

    

else:
    if(years%4==0):
        print("是闰年")
    
    
    else:
        print("不是闰年")

## 这里注意一点，和R语言和C语言不同，python的分支和循环是使用换行空格来表示关系，不是用｛｝
